let   
x = 6, 
y = 14, 
z = 4;
// console.log(x += y - x++ * z);
// (-4) код считуеться з ліва на право,
// спочатку іде множення 6*4=24,
// потім від y= 14-24=-10 + 6= -4;
// x++ відпрацюе вже після.
// console.log(z = -x - y * 5);
// (-76)код считуеться з ліва на право,
// спочтку іде множення 14*5=70, потім -6-70=-76мінус на мінус дае плюс при додавані.
// console.log(y /= x + 5 % z);
// (2) Спочатку відпрацьовуе остаток від ділення згідно таблиці 5 % z=1 , потім буде додавання 5 % z=1+ 6= 7,  14 / 7= 2 потім буде ділення з прирівнюванням.
// console.log(z -  x++ + y * 5);
// (68) Спочатку виконуеться множення 14*5=70, потім 4 - 6 = -2 + 70 = 68; Постфиксный инкремент відпрацьовуе вже після.
console.log(x = y - x++ * z);
// (-10) Спочатку відпрацьовуе множення 6 * 4 = 24, потім від 14 - 24 = -10, Постфиксный инкремент відпрацьовуе вже після.