// 1.Дані два масиви: ['a', 'b', 'c'] та [1, 2, 3]. Об'єднайте їх разом.  
// const arr1 = ['a', 'b', 'c'];
// const arr2 = [1, 2, 3];
// let  arr3 = []
// arr3.concat(arr1, arr2);
// 2.Дан масив ['a', 'b', 'c']. Додайте йому до кінця елементи 1, 2, 3.
// const arr1 = ['a', 'b', 'c'];
// arr1.push(1,2,3);
// 3. Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1].
// const arr =[1,2,3];
// const reversed = arr.reverse();
// 4.Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6.
// const arr = [1,2,3];
// arr.push(4,5,6);
// 5. Дан масив [1, 2, 3].Додайте йому на початок елементи 4, 5, 6.
// const arr =[1,2,3];
// console.log(arr.unshift(4,5,6));
// 6. Дан масив ['js', 'css', 'jq']. Виведіть перший елемент на екран.
// const arr =['js', 'css', 'jq'];
// document.write(arr[0]);
// 7. Дан масив [1, 2, 3, 4, 5]. За допомогою методу slice запишіть нові елементи [1, 2, 3].
// const arr = [1, 2, 3, 4, 5];
// console.log(arr.slice([1,2,3]));
// 8. Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 4, 5].
// const arr=[1, 2, 3, 4, 5];
// console.log(arr.splice(1,2));
// console.log(arr);
// 9.Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 2, 10, 3, 4, 5].
// const arr=[1, 2, 3, 4, 5];
// console.log(arr.splice(2, 0, 10));
// console.log(arr);
// 10. Дан масив [3, 4, 1, 2, 7]. Відсортуйте його.
// const arr =[3, 4, 1, 2, 7];
// arr.sort();
// console.log(arr);
// 11. Дан масив з елементами 'Привіт, ', 'світ' і '!'. Необхідно вивести на екран фразу 'Привіт, світ!'.
// const arr= ['Привіт, ', 'світ', '!'];
// document.write(arr[0],arr[1]);
// 12. Створіть масив arr з елементами 1, 2, 3, 4, 5 двома різними способами.
// const arr =[1, 2, 3, 4, 5];
// const arr1 = new Array([1, 2, 3, 4, 5]);
// console.log(arr);
// console.log(arr1);
// 13.Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'.
// const arr = ['a', 'b', 'c', 'd'];
// document.write(arr[0] + '+' + arr[1]+ ', ' + arr[2] + '+' + arr[3])
// 14. Запитайте у користувача кількість елементів масиву. Виходячи з даних, які ввів користувач створіть масив на ту кількість елементів, 
// яку передав користувач. у кожному індексі масиву зберігайте число який показуватиме номер елемента масиву.
// Зробіть так, щоб з масиву, який ви створили вище, вивелися всі непарні числа в параграфі, а парні в спані з червоним фоном.
const promN = Number(prompt('Write length please'));
let arr1 = [];
for (let i = 0; i <= promN; i++){
   arr1.push(i)
};
console.log(arr1);
let  arr2 = [];
let arrN = [];
for (let el = 0; el < arr1.length; el++){
    if(el % 2 == 0){
      arr2.push([el])
    }else {
      arrN.push([el])
    }
};
console.log(arr2)
console.log(arrN)
document.write("<p>" + arr2 + "</p>");
document.write("<span>" + arrN + "</span>");